--[[4013

]]
local G = require "gf"
local L = {}
local t = G.api
local o_battle_结果 = 0
t['天书_飞狐外传'] = function()
    local o_book_story = G.QueryName(0x101c0001)
    local int_mo = (228-224)*6+265
    if not G.call('in_team',5) then 
        G.call("talk",'',38,'   本故事没有胡斐是无法进行的！',2,1)
        G.call('all_over')
        return
    end 
    if o_book_story.流程 == 0 then
        G.call('地图_进入地图','佛山',256,67)
        G.call("talk",'',5,'   这位仁兄，刚才听你们讲“剖腹验鹅”后来怎么样？ ',0,0) 
        G.call("talk0",'胖商人','   锺四嫂在北帝爷爷座前磕了几个响头，说道：“‘北帝爷爷，我孩子决不能偷人家的鹅。他今年还只四岁，刁嘴拗舌，说不清楚，在财主爷面前说什么吃我，吃我！',126,163)
        G.call("talk0",'胖商人','小妇人一家横遭不白，赃官受了贿，断事不明，只有请北帝爷爷伸冤！”说着提起刀来，一刀便将小三子的肚子剖了。',126,163)
        G.call("talk",'',5,'   竟有此事？那这位财主老爷是何人？',0,0) 
        G.call("talk0",'胖商人','就是城东凤大老爷！',126,163)
        G.call("talk",'',5,'   多谢兄台告知！北帝爷爷，今日要你作个见证，我胡斐若不杀凤天南父子给锺家满门报仇，我回来在你座前自刎。',0,0) 
        G.call('地图_进入地图','凤家大院',257,67)
        G.call("talk",'',228,'   什么人，竟敢闯凤家大院？ ',1,1) 
        G.call("talk",'',5,'   敢问凤老爷可在？',0,0) 
        G.call("talk",'',228,'   我家老爷可是你说见就见的，看你偷偷摸摸的，先抓起来再说！ ',1,1) 
        G.call('all_over')
        G.call('set_team',5,0,0,0)
        G.call('call_battle',1,10,4,100,int_mo,int_mo+1,int_mo+2,int_mo+3,int_mo+4,int_mo+5)
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果 == 1  then
            G.call("talk",'',392,'   何人大胆闯我凤府？ ',1,1) 
            G.call("talk",'',5,'   我姓拔，杀鸡拔毛的拔。在下的名字便叫作‘凤毛’。！',0,0) 
            G.call("talk",'',392,'   欺人太甚，咱们兵刃上分高下便了。 ',1,1) 
            G.call('all_over')
            G.call('set_team',5,0,0,0)
            G.call('call_battle',1,10,4,100,392,0,0,0,0,0)
            o_battle_结果 = G.call('get_battle') 
            if o_battle_结果 == 1   then
                G.call("talk",'',5,'   你这恶霸我要你不得好死！',0,0) 
                G.call("talk",'',393,'   且慢，自称拔凤毛的小贼，你敢不敢出外我们斗个三百回合？ ',1,1) 
                G.call("talk",'',5,'   有何不敢？！',0,0)
                G.call('地图_进入地图','野外',7,67)
                G.call('all_over')
                G.call('set_team',5,0,0,0)
                G.call('call_battle',1,7,4,100,393,0,0,0,0,0)
                G.call("talk",'',5,'   你功夫倒是不错，但是为何要阻止我杀【凤南天】？',0,0)
                G.call("talk",'',393,'   日后你就明白了，我还有事，有机会再见！ ',1,1)  
            else
                G.call("talk",'',392,'   这点本事还是回去多学几年吧! ',1,1) 
            end
            o_book_story.流程 = 1 
        else
            G.call("talk",'',228,'   这点本事也敢来撒野！',1,1) 
        end
    elseif o_book_story.流程 == 1 then
        local int_mo = (229-224)*6+265
        local int_mo1 = (230-224)*6+265
        G.call('地图_进入地图','苗人凤居',28,67)
        G.call("talk",'',102,'   【苗人凤】你已中了【天下第一奇毒】！现在你双目失明，几天后就会全身溃烂而死，就算你有通天彻地的武功，也是难逃一死！看热闹的小兄弟，咱们一起联手除掉这个瞎子吧。',1,1) 
        G.call("talk",'',5,'   我看你们就这点伎俩，',0,0) 
        G.call("talk",'',102,'   真是找死！',1,1)
        G.call('all_over')  
        G.call('set_team',5,0,0,0)
        G.call('call_battle',1,7,4,100,102,229,int_mo,int_mo+1,int_mo1,230)
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果 == 1 then
            G.call("talk",'',156,'   小兄弟，我中的毒，只有【药王庄】的毒手药王才可医治，烦请去药王庄，苗某感激不尽。',1,1) 
            G.call('地图_进入地图','药王庄',23,67)
            G.call("talk",'',5,'   敢问毒手药王可在？',0,0) 
            G.call("talk",'',40,'   你是谁？找先师所为何事？',1,1)
            G.call("talk",'',5,'   在下胡斐，尊师不在，只是不知苗大侠这毒可怎么解！',0,0)
            G.call("talk",'',40,'   胡大哥，我就陪你走一趟吧！',1,1)
            G.call('地图_进入地图','苗人凤居',28,67)
            G.call("talk",'',40,'   苗前辈，晚辈是【药王庄】毒手药王的嫡传弟子，晚辈现在苗前辈身上下施针灸，片刻后苗前辈可双复原。',1,1)
            G.call('dark')
            G.call("talk",'',156,'   【药王庄】的弟子果然神乎其技！小兄弟，你救了苗某的性命，苗某没什么可报答的。不如指点你一招武功如何，这便是我的【苗家剑法】！',1,1) 
            if G.call('get_npcskill',5,0x1005002e) == 0 then 
                G.call('set_friend_skill',5,2,47,500)
            end
            G.call("talk",'',5,'   多谢苗大侠！',0,0) 
            if G.call('get_item',143) == 0  then 
                G.call('add_item',143,1)
            end 
            o_book_story.流程 = 2
        else
            G.call("talk",'',102,'   凭你的本事来多管闲事？快点滚吧。',1,1)  
        end
    elseif o_book_story.流程 == 2 then
        G.call('地图_进入地图','福康安府',113,67)
        G.call("talk",'',403,'   这玉龙杯还有四只，看场下哪四个门派掌门能够技高一筹取得就能够与少林、武当、三才剑、黑龙门四门合称【玉龙八门】！',1,1)  
        G.call('all_over')
        G.call('dark')
        G.call("talk0",'安提督','   万岁爷恩典，钦赐玉龙御杯，着少林派掌门人大智禅师、武当派掌门人无青子道人、三才剑掌门人汤沛、黑龙门掌门人海兰弼、天龙门掌门人田归农、药王门掌门人石万嗔，五虎门掌门人凤天南收执。恭喜恭喜！',126,163)
        G.call("talk",'',393,'   且慢，我这【九家半】掌门人都没登场，你们就开始分了？你们玉龙杯拿的住吗？ ',1,1)
        G.call('all_over')
        G.call('story','七人刚刚拿起玉龙杯，七个人手上犹似碰到了烧得通红的烙铁，实在拿捏不住，一齐松手。乒乒乓乓一阵清脆的响声过去，七只玉杯同时在青砖地上砸得粉碎') 
        G.call("talk",'',392,'   田掌门，定是这妖女从中作梗，我们先把这妖女擒下再说！',1,1) 
        G.call("talk",'',157,'   正有此意！ ',1,1) 
        G.call("talk",'',5,'   那也得问问我的刀答应不答应！',0,0)
        G.call('all_over')
        G.call('set_team',5,393,0,0)
        G.call('call_battle',1,113,4,200,157,392,0,0,0,0)
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果 == 1  then
            G.call("talk",'',157,'   此人刀法太厉害！汤大侠拦住他们！ ',1,1) 
            G.call('all_over')
            G.call('set_team',5,393,0,0)
            G.call('call_battle',1,113,4,999,404,0,0,0,0,0)  
            G.call("talk",'',40,'   汤大侠好一手【掷针术】，只是为何这针上会有剧毒？有石万嗔在，这也可以想得到；突然想起刚才碰过玉龙杯又使用内力的应该是活不过今日，再送你们一场毒雾！',1,1) 
            G.call("talk",'',40,'   胡大哥，袁姑娘我们走！',1,1) 
            o_book_story.流程 = 3
        else
            G.call("talk",'',392,'   凭你这本事也想英雄救美，快点滚吧！',1,1) 
        end
    elseif o_book_story.流程 == 3 then
        G.call('地图_进入地图','药王庄',23,67)
        if G.call('get_point',18) == 100 then
            G.call("talk",'',40,'   幸好袁姑娘只是受了内伤，休息几天应该没事，胡大哥虽中的是碧蚕毒蛊、鹤顶红、孔雀胆三种剧毒，但我有解救之法。',1,1)
            G.call("talk",'',5,'   程姑娘可是要替我吸毒？',0,0)
            G.call("talk",'',40,'   胡大哥你怎么猜到？',1,1)
            G.call("talk",'',5,'   如果你真替我吸毒而死今生你让我怎么好过？你赶紧想想可否有以毒攻毒的方法？',0,0)
            G.call("talk",'',40,'   我师父说中了这三种剧毒，无药可治，也许我只能一试，现在只有我种的【七星海棠】！',1,1)
            G.call("talk",'',5,'   只能听天由命了，程姑娘你就试试吧！',0,0)
            G.call("talk",'',40,'   好的，胡大哥！',1,1)
            G.call('dark')
            G.call("talk",'',40,'   胡大哥，你真的好了，真是谢天谢地！',1,1)
            G.call("talk",'',5,'   那也是多亏程姑娘你种活了【七星海棠】！',0,0)
            G.call("talk",'',393,'   今后我们就一起仗剑江湖！',1,1)
            G.call('join',40)
            G.call('join',393)
            o_book_story.完美 = 1
        else
            G.call("talk",'',40,'   幸好袁姑娘只是受了内伤，休息几天应该没事，胡大哥虽中的是碧蚕毒蛊、鹤顶红、孔雀胆三种剧毒，但我有解救之法。你们不会动弹，不会说话，那是服了那颗麻药药丸的缘故',1,1)
            G.call("talk",'',40,'   我师父说中了这三种剧毒，无药可治，因为他只道世上没有一个医生，肯不要自己的性命来救活病人。大哥，他不知我……我会待你这样…我知道你心中喜欢这袁姑娘...可袁姑娘...',1,1)
            G.call('dark')
            G.call("talk",'',5,'   程姑娘你怎么就不想想你自己,你这样为我你让我今生怎么能忘记你！',0,0)
            G.call("talk",'',393,'   胡大哥，你多保重，我要走了！',1,1) 
            G.call('leave',40)
            G.call('leave',393)
        end
        G.call('notice1','完成【飞狐外传】梦幻剧情！')
        o_book_story.完成 = 1
    end
    G.call('all_over')
    G.call('add_time',2)
    G.call('dark')
    G.call('goto_map',4)
end
t['天书_雪山飞狐'] = function()
    local o_book_story = G.QueryName(0x101c0002)
    if not G.call('in_team',5) then 
        G.call("talk",'',38,'   本故事没有胡斐是无法进行的！',2,1)
        G.call('all_over')
        return
    end 
    if o_book_story.流程 == 0 then
        G.call('地图_进入地图','塞外',42,67)
        G.call("talk",'',156,'   胡兄，我们这次比武点到为止！',1,1)
        G.call("talk",'胡一刀',5,'   依苗兄所言，来开始吧！',0,0)
        G.call('set_team',5,0,0,0)
        G.call('call_battle',1,42,4,200,156,0,0,0,0,0)
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果 == 1  then
            G.call('all_over')
            G.call("talk",'',156,'   胡兄刀法果然出神入化，不若我用【苗家剑法】和胡兄交换相互研习？',1,1)
            if G.call('get_npcskill',5,0x1005002e) == 0 then 
                G.call('set_friend_skill',5,2,47,500)
            end
            G.call("talk",'胡一刀',5,'   正合我意！',0,0)
            if G.call('get_item',143) == 0  then 
                G.call('add_item',143,1)
            end 
            G.call("talk",'',156,'   那下次我们再来比过！',1,1)
            o_book_story.流程 = 1
        else
            G.call('all_over')
            G.call("talk",'胡一刀',5,'   苗兄剑法果然出神入化，下次我们再来比过！',0,0)
            G.call("talk",'',156,'   那下次我们再来比过！',1,1)
            G.call("talk",'',178,'   二位不若到寒舍住上一宿，下次再来比过吧！',1,1)
            G.call("talk",'胡一刀',5,'   多谢！',0,0)
            o_book_story.流程 = 2
        end
    elseif o_book_story.流程 == 1 then
        G.call("talk",'',156,'   胡兄，【胡家刀法】果然出神入化，和我【苗家剑法】可以起到相辅相成！',1,1)
        G.call("talk",'胡一刀',5,'   正是如此，我们再来切磋一番！',0,0)
        G.call('set_team',5,0,0,0)
        G.call('call_battle',1,42,4,200,156,0,0,0,0,0)
        G.call("talk",'胡一刀',5,'   苗兄怎么感觉我们这刀剑颜色不对！',0,0)
        G.call("talk",'',156,'   这不会是上次那个阎基搞的鬼吧！',1,1)
        G.call("talk",'胡一刀',5,'   我现在就去找他！',0,0)
        G.call('地图_进入地图','阎基居',69,67)
        G.call("talk",'胡一刀',5,'   阎基在吗？',0,0)
        G.call("talk",'',178,'   看来是你打赢了金面佛【苗人凤】，哈哈，这【断肠草】的毒果然了得！',1,1)
        G.call("talk",'胡一刀',5,'   原来是你这小人，拿命来！',0,0)
        G.call('all_over')
        G.call('set_team',5,0,0,0)
        G.call('call_battle',1,42,4,200,178,0,0,0,0,0)
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果 == 1  then
            G.call("talk",'胡一刀',5,'   狗贼，你为何要加害我们二人？',0,0)
            G.call("talk",'',178,'   是【天龙门】掌门田归农说为了不让你阻止他们找寻闯王宝藏才让我做的，说事成之后....',1,1)
            G.call("talk",'胡一刀',5,'   去死吧！',0,0)
            o_book_story.流程 = 3
        else
            G.call("talk",'',178,'   就这点本事也敢出来丢人现眼！',1,1)
        end
    elseif o_book_story.流程 == 2 then
        G.call("talk",'',156,'   胡兄，这次比武愚兄要出全力了！',1,1)
        G.call("talk",'胡一刀',5,'   好，正好战个痛快！',0,0)
        G.call('all_over')
        G.call('set_team',5,0,0,0)
        G.call('call_battle',1,42,4,9999,156,0,0,0,0,0)
        G.call("talk",'胡一刀',5,'   这剑上有剧毒...苗兄.....',0,0)
        G.call("talk",'',156,'   愚兄定当查个水落石出！',1,1)
        G.call("talk",'胡一刀',5,'   好想看看斐儿长大！',0,0)
        o_book_story.完成 = 1
        G.call('notice1','完成【雪山飞狐】梦幻剧情！')
    elseif o_book_story.流程 == 3 then
        G.call('地图_进入地图','大雪山',110,67)
        local int_mo = (227-224)*6+265
        G.call("talk",'胡一刀',5,'   田归农你个小人，竟然使出如此卑劣手段！',0,0)
        G.call("talk",'',157,'   你可真命大，可是这次你就没有这好的命了！',1,1)
        G.call('all_over')
        G.call('set_team',5,0,0,0)
        G.call('call_battle',1,42,4,200,157,227,int_mo,int_mo+1,int_mo+2,int_mo+3)
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果 == 1  then
            G.call("talk",'',157,'   真够狠的你...........',1,1)
            G.call("talk",'胡一刀',5,'   让你知道【飞天狐狸】的厉害！',0,0)
            if G.call('get_item',264) == 0  then 
                G.call('add_item',264,1)
            end 
            o_book_story.完美 = 1
            o_book_story.完成 = 1
            G.call('notice1','完成【雪山飞狐】梦幻剧情！')
        else
            G.call("talk",'',157,'   就这点本事也敢出来丢人现眼！',1,1)
        end
    end
    G.call('all_over')
    G.call('add_time',2)
    G.call('dark')
    G.call('goto_map',4)
end
t['天书_连城诀'] = function()
    local o_book_story = G.QueryName(0x101c0003)
    local int_mo = (228-224)*6+265
    if not G.call('in_team',10) then 
        G.call("talk",'',38,'   本故事没有狄云是无法进行的！',2,1)
        G.call('all_over')
        return
    end 
    if o_book_story.流程 == 0 then
        G.call('地图_进入地图','地牢',111,10)
        G.call("talk",'',10,'   这是哪里，我怎么会在这里？',0,0)
        G.call("talk",'',394,'   你又是那狗官派来的吧，看你和上次那几个比怎么样？',2,1)
        G.call('all_over')
        G.call('set_team',10,0,0,0)
        G.call('call_battle',1,111,4,999,394,0,0,0,0,0)
        G.call("talk",'',394,'   这点本事应该不是那狗官派来的，你是谁？',2,1)
        G.call("talk",'',10,'   我叫狄云，大哥你是？',0,0)
        G.call("talk",'',394,'   丁典，你先休息吧，被打搅我练神功！',2,1)
        G.call('dark')
        G.call("talk",'',394,'   你看窗台上的菊花多美？',2,1)
        G.call("talk",'',10,'   为何大哥每日盯着窗台看呢？',0,0)
        G.call("talk",'',394,'   能看到这花我就知道霜华现在很好！',2,1)
        G.call('dark')
        G.call("talk0",'万 圭','臭小子，告诉你，你的师妹已经嫁给我了，你可以死心了！',126,163)
        G.call("talk",'',10,'   你个禽兽，是不是你胁迫了我师妹！',0,0)
        G.call("talk0",'万 圭','哈哈，你就死心吧，她是心甘情愿的！',126,163)
        G.call("talk",'',10,'   师妹都嫁人了，我活着还有什么意思，我还不如。。。。。！',0,0)
        G.call('dark')
        G.call("talk",'',394,'   臭小子，你怎么那么傻，这不是我练成神照功救了你，今日你就真见阎王了！',2,1)
        G.call("talk",'',10,'   你为什么要救我啊！',0,0)
        G.call("talk",'',394,'   因为至少你知道你师妹是活着的，活着就是希望！',2,1)
        G.call("talk",'',10,'   我知道了，谢谢大哥！',0,0)
        G.call("talk",'',394,'   看你身上衣服都破烂了，把这件衣服穿上吧，我再传你点神照经防身！',2,1)
        if G.call('get_item',76) == 0 then
            G.call('add_item',76,1)
        end 
        if G.call('get_item',265) == 0 then
            G.call('add_item',265,1)
        end 
        G.call("talk",'',10,'   多谢大哥！',0,0)
        if G.call('get_npcskill',10,0x1005008f) == 0 then 
            G.call('set_friend_skill',10,3,144,500)
        end
        o_book_story.流程 = 1
    elseif o_book_story.流程 == 1 then
        G.call('地图_进入地图','地牢',111,10)
        G.call("talk",'',394,'   窗台上的菊花都枯萎好几天了，我有不好的预感？',2,1)
        G.call("talk",'',10,'   是不是你口中念的霜华她病了或者是忘记了？',0,0)
        G.call("talk",'',394,'   不会的，不论怎样，只要她在她会想办法换的，除非.....今晚我们先出去看看！',2,1)
        G.call('地图_进入地图','内室',97,40)
        G.call("talk",'',394,'   “爱女凌霜华之灵位”，这不会是真的，霜华，你果然先我而去了',2,1)
        G.call('dark')
        G.call("talk",'',395,'   啊，我道是谁，原来是丁大侠。小女不幸逝世，有劳吊唁，存殁同感。小女去世已五天了，大夫也说不上是什么病症，只说是郁积难消。',2,1)
        G.call("talk",'',394,'   这可遂了你的心愿。',2,1)
        G.call("talk",'',395,'   丁大侠，你可忒也固执了，倘若早早说了出来，小女固然不会给你害死，我和你更成了翁婿，那是何等的美事。',2,1)
        G.call("talk",'',394,'   倘若我今日杀了你，霜华在天之灵定然恨我。凌退思，瞧在你女儿的份上，你折磨了我这七年，咱们一笔勾销。今后你再惹上我，可休怪姓丁的无情。狄兄弟，走吧。。',2,1)
        G.call("talk",'',395,'   丁大侠，咱们落到今日的结果，你说有什么好处？',2,1)
        G.call("talk",'',394,'   你清夜抚心自问，也有点惭愧么？你只贪图那什么‘连城诀’，宁可害死自己女儿。',2,1)
        G.call("talk",'',395,'   丁大侠，你不忙走，还是将那剑诀说了出来，我便给解药于你，免得枉自送了性命。',2,1)
        G.call("talk",'',394,'   你在棺木上又涂上了“金波旬花”的剧毒，你可真够恶毒的！',2,1)
        G.call("talk",'',10,'   你这狗官，大哥我们先走！',0,0)
        G.call("talk",'',395,'   还想走，没那容易！',2,1)
        G.call('all_over')
        G.call('set_team',10,0,0,0)
        G.call('call_battle',1,111,4,150,395,int_mo,int_mo+1,int_mo+2,int_mo+3,int_mo+4)
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果 == 1 then
            G.call('all_over')
            G.call("talk",'',10,'   总算打退狗官！',0,0)
            o_book_story.流程 = 2
        else
            G.call("talk",'',395,'   这点本事也想逞能！',2,1)
        end
    elseif o_book_story.流程 == 2 then
        G.call('地图_进入地图','内室',97,40)
        G.call("talk",'',10,'   大哥你怎么样，还好吧！',0,0)
        G.call("talk",'',394,'   这次我怕是真的不行了',2,1)
        if G.call('get_item',235) > 0 then
            G.call("talk",'',10,'   大哥我这里有【雪参玉蟾丸】，应该可以解除这【金波旬花】之毒，赶紧服下！',0,0)
            G.call('add_item',235,-1)
            G.call('dark')
            G.call("talk",'',394,'   狄兄弟，我真的好了，找个趁手的撬开棺木，也许我的神照功能够。。。。',2,1)
            G.call("talk",'',10,'   是的大哥，你试试！',0,0)
            G.call('dark')
            G.call("talk",'',407,'   典哥，我真的好高兴，好高兴，我又能看到你了....',2,1)
            G.call("talk",'',394,'   狄兄弟，这次多谢你了，也没别的教你，再教你套【无影神拳】！',2,1)
            if G.call('get_npcskill',10,0x100500ec) == 0 then 
                G.call('set_friend_skill',10,1,237,500)
            end
            G.call("talk",'',394,'   我和霜华就不再过问世事了，你自己也多加小心！',2,1)
            o_book_story.完美 = 1
        else
            G.call("talk",'',10,'   大哥，你有什么心愿未了？',0,0)
            G.call("talk",'',394,'   我只希望我死后你将我和霜华葬在一起！',2,1)
            G.call("talk",'',10,'   我答应就是！',0,0)
            G.call('story','就这样狄云将丁典以及凌霜华安葬了！') 
        end 
        o_book_story.完成 = 1
        G.call('notice1','完成【连城诀】梦幻剧情！')
    end
    G.call('all_over')
    G.call('add_time',2)
    G.call('dark')
    G.call('goto_map',4)
end
t['天书_天龙八部'] = function()
    local o_book_story = G.QueryName(0x101c0004)
    if not G.call('in_team',36) then 
        G.call("talk",'',38,'   本故事没有乔峰是无法进行的！',2,1)
        G.call('all_over')
        return
    end 
    if o_book_story.流程 == 0 then
        G.call('地图_进入地图','杏子林',258,52)
        G.call("talk",'',174,'   小女子殓葬先夫之后，检点遗物，在他收藏拳经之处，见到一封用火漆密密封固的书信，后将书信辗转交与徐长老，余事请徐长老细说！',2,1)
        G.call("talk",'',36,'   （你们有什么阴谋，尽管使出来好了。乔某生平不作半点亏心事，不管有何倾害诬陷，乔某何惧？）',0,0)
        G.call("talk",'徐长老',170,'   这封便是马大元的遗书。大元的曾祖、祖父、父亲，数代都是丐帮中人，不是长老，便是八袋弟子。我眼见大元自幼长大，他的笔迹我是认得很清楚的。这信封上的字，确是大元所写。',2,1)
        G.call("talk",'',170,'   马夫人将信交到我手中之时，信上的火漆仍然封固完好，无人动过。我也担心误了大事，不等会同诸位长老，便即拆来看了。拆信之时，太行山铁面判官单兄也正在座，可作明证。',2,1) 
        G.call("talk",'',97,'   不错，其时在下正在郑州徐老府上作客，亲眼见到他拆阅这封书信。',2,1)   
        G.call("talk",'',170,'   我一看这张信笺，见信上字迹笔致遒劲，并不是大元所写，微感惊奇，见上款写的是‘剑髯吾兄’四字，更是奇怪。',2,1) 
        G.call("talk",'',170,'   众位都知道，‘剑髯’两字，是本帮前任汪帮主的别号，若不是跟他交厚相好之人，不会如此称呼，而汪帮主逝世已久，怎么有人写信与他？我不看笺上所写何字，先看信尾署名之人，一看之下，更是诧异。',2,1)
        G.call("talk",'',170,'   当时我不禁‘咦’的一声，说道：‘原来是他！’单兄好奇心起，探头过来一看，也奇道：‘咦！原来是他！',2,1) 
        G.call("talk",'智光大师',92,'   先让我瞧瞧，是否真是原信。',2,1)    
        G.call("talk",'',36,'   你……你干什么？为何将信尾的署名撕下来吃了？',0,0) 
        G.call("talk",'',36,'   这竟然末尾是：字谕丐帮马副帮主、传功长老、执法长老、暨诸长老：乔峰若有亲辽叛汉、助契丹而厌大宋之举者，全帮即行合力击杀，不得有误。下毒行刺，均无不可，下手者有功无罪。汪剑通亲笔。',0,0)
        G.call("talk",'',174,'   先夫不幸亡故，到底是何人下的毒手，此时自是难加断言。但想先夫平生诚稳笃实，拙于言词，江湖上并无仇家，妾身实在想不出，为何有人要取他性命。',2,1)
        G.call("talk",'',174,'   然而常言道得好：‘慢藏诲盗’，是不是因为先夫手中握有什么重要物事，别人想得之而甘心？别人是不是怕他泄漏机密，坏了大事，因而要杀他灭口？',2,1) 
        G.call("talk",'',36,'   你疑心是我害死了马副帮主？',0,0)
        G.call("talk",'',174,'   妾身是无知无识的女流之辈，出外抛头露面，已是不该，何敢乱加罪名于人？只是先夫死得冤枉，哀恳众位伯伯叔叔念着故旧之情，查明真相，替先夫报仇雪恨。',2,1) 
        G.call("talk",'',134,'   马夫人，我心中有一个疑团，我听夫人言道，马前辈这封遗书，乃是用火漆密密固封，而徐长老开拆之时，漆印仍属完好。那么在徐长老开拆之前，谁也没看过信中的内文了？然则那位带头大侠的书信和汪帮主的遗令，除了马前辈之外，本来谁都不知。慢藏诲盗、杀人灭口的话，便说不上。',2,1)
        G.call("talk",'',174,'   姑娘是谁？却来干预我帮中的大事？',2,1)
        G.call("talk",'',134,'   贵帮大事，我一个小小女子，岂敢干预？只是你们要诬陷我们公子爷，我非据理分辨不可。',2,1) 
        G.call("talk",'',174,'   姑娘之言甚是，只是我在拾到一柄折扇，请徐长老明鉴！',2,1)
        G.call("talk",'',170,'   朔雪飘飘开雁门，平沙历乱卷蓬根；功名耻计擒生数，直斩楼兰报国恩。这扇面正是我的题字，非我族类，其心必异。汪帮主啊汪帮主，你这件事可大大的做错了。',2,1)
        G.call("talk",'',36,'   (有人盗我折扇，嫁祸于我，这等事可难不倒乔峰。)[br]徐长老，这柄折扇是我的。',0,0)
        G.call("talk",'',170,'   汪帮主总算将我当我心腹，可是密留遗令这件大事，却不让我知晓。',2,1)
        G.call("talk",'',174,'   丐帮中只大元知道此事，便惨遭不幸，你……你……若是事先得知，未必能逃过此劫。',2,1)
        G.call("talk",'',36,'   乔某身世来历，惭愧得紧，我自己未能确知。但既有这许多前辈指证，乔某须当尽力查明真相。这丐帮帮主的职份，自当退位让贤。',0,0)
        G.call("talk",'',36,'   乔峰身世未明，这帮主一职，无论如何是不敢担任了。徐长老、传功、执法两位长老，本帮镇帮之宝的打狗棒，请你三位连同保管。日后定了帮主，由你三位一同转授不迟。马副帮主到底是谁所害，是谁偷了我这折扇，去陷害于乔某，终究会查个水落石出。',0,0)
        G.call("talk",'',36,'   马夫人，以乔某的身手，若要到你府上取什么事物，谅来不致空手而回，更不会失落什么随身物事。别说府上只不过三两个女流之辈，便是皇宫内院，相府帅帐，千军万马之中，乔某要取什么物事，也未必不能办到。',0,0)
        G.call("talk",'',36,'   青山不改，绿水长流，众位好兄弟，咱们再见了。',0,0)
        G.call('地图_进入地图','野外',154,35)
        G.call("talk",'',36,'   (这竟然遇到四大恶人围攻丐帮兄弟！)[br]休伤我丐帮兄弟？',0,0)
        G.call("talk",'奚长老',169,'   乔帮主，我等欲去参加大会，却被四大恶人围截！',2,1)
        G.call("talk",'',36,'   先打发了这群恶人再说！',0,0)
        G.call('all_over')
        G.call('set_team',36,0,0,0)
        G.call('call_battle',1,20,4,200,104,105,106,107,0,0,0,66) 
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果 == 1  then
            G.call("talk",'奚长老',169,'   多谢帮主解围',2,1)
            G.call("talk",'',36,'   众位兄弟不说了，待我调查出真相，青山不改，绿水长流，众位好兄弟，咱们再见了。',0,0)
            o_book_story.流程 = 1 
        else
            G.call("talk",'',104,'   真是不自量力！',2,1)
        end
    elseif  o_book_story.流程 == 1 then   
        G.call('地图_进入地图','少林寺',135,59)
        G.call("talk",'',36,'   发现一个黑影好像进了少林寺，跟过去看看！',0,0)
        G.call('地图_进入地图','少林寺内阁',134,59)
        G.call("talk",'',36,'   (噫，这小沙弥在拍什么：一-梦-如-是，好像拿了什么经书)',0,0)
        G.call("talk",'',239,'   有盗贼进入了少林寺',2,1)
        G.call('all_over')
        G.call('set_team',36,0,0,0)
        G.call('call_battle',1,134,4,150,110,175,176,177,0,0,0,66) 
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果 == 1  then
            G.call("talk",'',175,'   这厮太厉害，还是让他们跑了，不过另外一个中了我大力金刚指...不说了，先看经书...',2,1) 
            G.call("talk",'',239,'   不好，易筋经不见了！',2,1)
            G.call('地图_进入地图','客栈',3,59)
            G.call("talk",'',36,'   这小沙弥到底是谁？...噫，这是易容的，这不是刚才帮我说话的慕容家的那个阿朱姑娘吗？我先为了疗伤再说！',0,0)
            G.call('dark')
            G.call("talk",'',134,'   乔大爷，是你救了我吗？',2,1)
            G.call("talk",'',36,'   是的，不过你这伤还是很重，得找神医医治！',0,0)
            G.call('dark')
            G.call("talk",'门派弟子',236,'   乔帮主，三天后聚贤庄英雄大会请帖，烦请乔帮主到时参加！',2,1) 
            G.call("talk",'',36,'   这英雄大会薛神医应该在的，阿朱，我们就去走一遭吧！',0,0)
            o_book_story.流程 = 2
        else
            G.call("talk",'',239,'   本事不到家还学别人来盗经书！',2,1) 
        end
    elseif  o_book_story.流程 == 2 then
        G.call('地图_进入地图','聚贤庄',40,59)  
        G.call("talk",'',36,'   乔峰拜庄',0,0)
        G.call("talk",'',118,'   有请！',2,1) 
        G.call("talk",'',36,'    闻道薛神医和游氏兄弟在聚贤庄摆设英雄大宴，乔峰不齿于中原豪杰，岂敢厚颜前来赴宴？只是今日有急事相求薛神医，来得冒昧，还望恕罪。',0,0)
        G.call("talk",'',118,'    乔兄有什么事要在下效劳？',2,1) 
        G.call("talk",'',36,'   只因在下行事鲁莽，累得这小姑娘中了别人的掌力，身受重伤。当今之世，除了薛神医外，无人再能医得，是以不揣冒昧，赶来请薛神医救命！',0,0)
        G.call("talk",'',118,'   看着姑娘伤势应该是中了大力金刚指内伤，要医治不难，只是事出蹊跷！',2,1) 
        G.call("talk",'',36,'   薛先生今日救了这位姑娘，乔峰日后不敢忘了大德。',0,0)
        G.call("talk",'',118,'   日后不敢忘了大德？难道今日你还想能活着走出这聚贤庄么？',2,1) 
        G.call("talk",'',36,'   我乔峰要走，你们谁能阻挡，况且是活着出去也好，死着出去也好，那也管不了这许多。这位姑娘的伤势，总得请你医治才是。',0,0)
        G.call("talk",'',118,'   我为什么要替她治伤？',2,1) 
        G.call("talk",'',36,'   救人一命，胜造七级浮屠。薛先生在武林中广行功德，眼看这位姑娘无辜丧命，想必能打地劝先生的恻隐之心。。',0,0)
        G.call("talk",'',118,'   不论是谁带这姑娘来，我都给她医治。哼，单单是你带来，我便不治。',2,1) 
        G.call("talk",'',36,'   众位今日群集聚贤庄，为的是商议对付乔某，姓乔的岂有不知？',0,0)
        G.call("talk",'',134,'   啊哟，乔大爷，既然如此，你就不该为了我而到这里来冒险啦。',2,1) 
        G.call("talk",'',36,'   这里众家英雄，多有乔峰往日旧交，今日既有见疑之意，咱们干杯绝交。哪一位朋友要杀乔某的，先来对饮一碗，从此而后，往日交情一笔勾销。我杀你不是忘恩，你杀我不算负义。天下英雄，俱为证见。',0,0)
        G.call("talk",'',36,'   白兄弟，医治这位阮姑娘就劳烦你了！',0,0)
        G.call("talk",'白世镜',172,'   乔兄放心，白世镜定当救恳薛神医赐予医治。这位阮姑娘若有三长两短，白世镜自刎以谢乔兄便了。',2,1) 
        G.call("talk",'',36,'   那现在就让我们打个痛快！',0,0)
        G.call('all_over')
        G.call('set_team',36,0,0,0)
        G.call('call_battle',1,134,4,200,110,175,176,177,0,0,0,66) 
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果 == 1  then
            G.call("talk",'',36,'   你们就一起来吧！',0,0)
            G.call("talk",'黑衣人',408,'   愚不可及，为了一个小女子就不要自己的命了，走！',2,1) 
            G.call('地图_进入地图','野外',258,59) 
            G.call("talk",'',36,'   恩不敢言谢，只求恩兄让乔峰一见庐山直面。',0,0)
            G.call("talk",'黑衣人',408,'   你这臭骡子，练就了这样一身天下无敌的武功，为了一个低三下四的小丫头，天下哪有你这等大傻瓜？',2,1) 
            G.call("talk",'',36,'   恩公教训得是。乔峰以有用之身，为此无益之事，原是不当。只是一时气愤难当，蛮劲发作，便没细想后果。',0,0)
            G.call("talk",'黑衣人',408,'   嘿嘿，原来是蛮劲发作。',2,1) 
            o_book_story.流程 = 3
        else
            G.call("talk",'',118,'   没本事就不要逞强！',2,1) 
        end
    elseif  o_book_story.流程 == 3 then
        G.call('地图_进入地图','雁门关',259,59)
        G.call("talk",'',36,'   我不是汉人，我不是汉人！我是契丹胡虏，我是契丹胡虏！',0,0)
        G.call("talk",'',134,'   乔大爷，你再打下去，这座山峰也要给你击倒了。',2,1) 
        G.call("talk",'',36,'   阿朱，你身子大好了？',0,0)
        G.call("talk",'',134,'   乔大爷，我……我在这里已等了你五日五夜，我只怕你不能来。你……你果然来了，谢谢老天爷保佑，你终于安好无恙。',2,1) 
        G.call("talk",'',36,'   薛神医妙手回春，果真乐不虚传。',0,0)
        G.call("talk",'',134,'   幸得你的好朋友白世镜长老，答允传他七招‘缠丝擒拿手’，薛神医才给我治伤。',2,1) 
        G.call("talk",'',36,'   现下我们先去探访徐长老，至少先问明那个带头大哥是谁！',0,0)
        G.call("talk",'',134,'   便是到天崖海角，我也和你同行。',2,1) 
        G.call('地图_进入地图','客栈',3,59)
        G.call("talk0",'乞丐甲','徐长老可死得真惨，前胸後背，肋骨尽断，一定又是乔峰那恶贼下的毒手。',126,163)
        G.call("talk0",'乞丐乙','   後天在河南卫辉开吊，帮中长老、弟兄们都去祭奠，总得商量个擒拿乔峰的法子才是。',-112,157)
        G.call("talk",'',134,'   徐长老竟然死了！',2,1) 
        G.call("talk",'',36,'   事不宜迟，我们得赶往天台山去问问智光大师！',0,0)
        G.call('地图_进入地图','天台山',260,59)
        G.call("talk",'智光大师',92,'   贵客远来，老失迎。善哉，善哉！乔施主，你本是姓萧，自己可知道麽？',2,1)   
        G.call("talk",'',36,'   打扰大师清修，深为不安。小可不孝，正是来求大师指点。',0,0)
        G.call("talk",'智光大师',92,'   令尊在雁门关外石壁之上，留下字迹，自称姓萧，名叫远山。他在遗文中称你为『峰儿』。萧大侠，雁门关外石壁上所留的字足迹，你想必已经见到了？',2,1)   
        G.call("talk",'',36,'   在下直至今日，始知父亲姓名，尽出大师恩德，受在下一拜，至于石壁上的字足迹已给人铲得干干净净，什麽痕迹也没留下。',0,0)
        G.call("talk",'智光大师',92,'   施主，这便是石壁遗文的拓片。',2,1)   
        G.call("talk",'',36,'   『峰儿周岁，偕妻往外婆家赴宴，途中突遇南朝大盗……事出仓促，妻儿为盗所害，作亦不欲再活人世。作受业恩师乃南朝汉人，余在师前曾立誓不杀汉人，岂知今日一杀十余，既愧且痛，死後亦无面目以见恩师矣。萧远山绝笔。』！',0,0)
        G.call("talk",'智光大师',92,'   事後我们查究少林夺经这消息的来源，原来是出於一个妄人之品，此人存心戏弄那位带头大哥，要他千里奔波，好取笑他一番。带头大哥查明真相，自是恼怒之极，那妄人却逃了个不知去向，从此无影无踪。如今事隔三十年，想来也必不在人世了。',2,1)  
        G.QueryName(0x10040024).姓名 = '萧  峰'
        G.call("talk",'',36,'      从今而後，我是萧峰，不是乔峰了。',0,0)
        G.call("talk",'',36,'   多谢大师千知这件事的前因後果，使萧峰得能重新为人。萧某只想再问一件事。那位带头大哥，究是何人？！',0,0)
        G.call("talk",'智光大师',92,'   万物一般，众生平等。圣贤畜生，一视同仁。汉人契丹，亦幻亦真。恩怨荣辱，俱在灰尘!',2,1)   
        G.call("talk",'',36,'   大师，到底那个带头大哥是谁，还请见示。',0,0)
        G.call("talk",'',134,'   智光大师已经圆寂....',2,1) 
        G.call("talk",'',36,'   阿朱，我全无加害智光大师之意，他……他……他又何苦如此？',0,0)
        G.call("talk",'',134,'   我想智光大师写在地下的那几句话，倒也很有道理。什麽『汉人契丹，亦幻亦真。恩怨荣辱，俱化灰尘』。其实你是汉人也好，是契丹人也好，又有什麽分别？',2,1) 
        G.call("talk",'',134,'   其实你是汉人也好，是契丹人也好，又有什麽分别？江湖上刀头上的生涯，想来你也过得厌了，不如便到雁门关外去打猎放牧，中原武林的恩怨荣辱，从此再也别理会了。',2,1) 
        G.call("talk",'',36,'   这些刀头上酚命的勾当，我的确过得厌了。在塞外草原中驰马放鹰，纵犬逐兔，从此无牵挂，当真开心得多。阿朱，我在塞外，你来瞧我不瞧？',0,0)
        G.call("talk",'',134,'   我不是说『放牧』麽？你驰马打猎，我便放牛放羊，便跟着你杀人放火，打家劫舍，也永不後悔。跟着你吃尽千般苦楚，万种熬煎，也是欢欢喜喜。',2,1) 
        G.call("talk",'',36,'   萧某得有今日，别说要我重当丐帮帮主，就是叫我做大宁皇帝，我也不干。阿朱，这就到信阳找马夫人去，她肯说也罢，不肯说也罢，这是咱们最後要找的一个人了。一句话问过，咱们便到塞外打猎放羊去也！',0,0)
        G.call("talk",'',36,'   是了！从今而後，萧某不再是孤孤单单、给人轻蔑鄙视的胡虏贱种，这世上至少有一个人……有一个人……',0,0)
        G.call("talk",'',134,'   有一个人敬重你、钦佩你、感激你、愿意永永远远、生生世世、陪在你身边，和你一同抵受患难屈辱、艰险困苦。',2,1) 
        G.call("talk",'',134,'   大哥，你想咱们怎样去盘问马夫人才好？',2,1) 
        G.call("talk",'',36,'   我想咱们只好善言相求，盼她能明白事理，不再冤本我杀她丈夫。阿朱，不如你去跟她说，好不好？你囗齿伶俐，大家又都是女子。只怕她一见我之面，满腔怨恨，立时便弄僵了。',0,0)
        G.call("talk",'',134,'   大哥，我想假扮一个人，去哄得马夫人说出那个大恶人的姓名来。我假扮了此人，马夫人想到是丈夫的知交好友，料来便不会隐瞒。',2,1) 
        G.call("talk",'',36,'   嗯，丐帮中和马大元兄弟最交好的，一个是王舵主，一个是全冠清，一个是陈长老，还有，执法长老白世镜跟他交谊也很深度。',0,0)
        G.call("talk",'',134,'   我还是学白长老的好。他在聚贤庄中跟我说过几次话，学他最是容易。',2,1) 
        G.call("talk",'',36,'   白长老待你甚好，力求薛神医给你治伤。你扮了他的样子去骗人，不有点对他不起麽？',0,0)
        G.call("talk",'',134,'   我扮了白长老後，只做好事，不做坏事，不累及他的名声，也就是了。',2,1) 
        o_book_story.流程 = 4
    elseif  o_book_story.流程 == 4 then
        G.call('地图_进入地图','马大元家',261,59)
        G.call("talk",'',134,'   萧大哥你到外边去等我，我私下问马夫人去！',2,1) 
        G.call('dark')
        if G.call('get_point',8) == 7 and G.call('get_point',11) == 10 then 
            G.call("talk",'',174,'   你……你又来做什麽？',2,1) 
            G.call("talk",'阿  朱',172,'   (这句话何解，难道马夫人和白长老之间还有其他联系，那就先套问下再说！)',0,0)
            G.call("talk",'阿  朱',172,'   也不是什么大事，只是乔峰要是知道此间之事恐怕不会善罢甘休！',0,0)
            G.call("talk",'',174,'   他怎会知道？他怎会知道！',2,1) 
            G.call("talk",'阿  朱',172,'    那日在客栈，乔峰跟我说起一件事，说他知道谁是下手害死马兄弟的真凶。',0,0)
            G.call("talk",'',174,'   你胡说八道，不是活见鬼麽？',2,1) 
            G.call("talk",'阿  朱',172,'   (看来这白长老和马夫人之间的确有不可告人的秘密)[br]现下也不知如何是好，我们何不联合那位【带头大哥】来对付乔峰那厮？',0,0)
            G.call("talk",'',174,'   这个估计有点难，这位【带头大哥】假慈悲，当年就没斩草除根！',2,1) 
            G.call("talk",'阿  朱',172,'   要不我去联络一下这位【带头大哥】看看？',0,0)
            G.call("talk",'',174,'   玄慈那老东西不会那好说话的，还是从长计议吧！',2,1) 
            G.call("talk",'阿  朱',172,'   不过我还是担心乔峰知道后后果不堪设想！',0,0)
            G.call("talk",'',174,'   哈哈，就是要让他知道，让他将这天下搅个天翻地覆！',2,1)
            G.call("talk",'阿  朱',172,'   (这人疯了，还是先走吧！)[br]自己多加小心，外面还有人等着，有我在，定不叫你难堪！',0,0)
            G.call('dark')
            G.call('地图_进入地图','客栈',3,59)
            G.call("talk",'',134,'   大哥，这【带头大哥】竟然是少林玄慈大师，这可如何是好？',2,1) 
            G.call("talk",'',36,'   我知道你担心什么，我只是去问个清楚，然后我们便到塞外打猎放羊去也！',0,0)
            G.call("talk",'',134,'   大哥去哪里，我就跟你去哪里！',2,1) 
            o_book_story.流程 = 5
        else
            G.call("talk",'',174,'   你……你又来做什麽？',2,1) 
            G.call("talk",'阿  朱',172,'   也不是什么大事，只是乔峰要是知道此间之事恐怕不会善罢甘休！',0,0)
            G.call("talk",'',174,'   他怎会知道？他怎会知道！',2,1) 
            G.call("talk",'阿  朱',172,'    那日在客栈，乔峰跟我说起一件事，说他知道谁是下手害死马兄弟的真凶。',0,0)
            G.call("talk",'',174,'   你胡说八道，不是活见鬼麽？',2,1) 
            G.call("talk",'阿  朱',172,'    这事有蹊跷事，到如今，我只好问带头大哥去。',0,0)
            G.call("talk",'',174,'   嗯，你远兜子的，原来是想套问这带头大哥的名号。',2,1) 
            G.call("talk",'阿  朱',172,'    若是不便，弟妹也不用跟我说，不妨你自己去设法查明，咱们再找那正凶算账。',0,0)
            G.call("talk",'',174,'   这带头大哥的姓名，对别人当然要瞒，免得乔峰知道之後，去找他报杀父杀母之仇，白长老是自己人，我又何必瞒你？他便是……天上月亮这样圆，又这样白。',2,1) 
            G.call("talk",'阿  朱',172,'    到得十五，月，亮自然又圆又亮，唉，只可惜马兄弟却再也见不到了。',0,0)
            G.call("talk",'',174,'   你爱吃咸的月饼，还是甜的？',2,1) 
            G.call("talk",'阿  朱',172,'    我们做叫化子的，吃月饼还能有什麽挑剔？找不到真凶，不给马兄弟报此大仇，别说月饼，就是山珍海味，入囗也是没半分滋味',0,0)
            G.call("talk",'',174,'   这位带头大哥，乃大理国当今皇帝的亲弟，姓段名正淳，封为镇南王的便是。',2,1) 
            G.call("talk",'阿  朱',172,'    那我便到大理去拜访镇南王，旁敲侧击，请问他去年中秋，在他府上作客的有那几个人，便可查到害死马兄弟的真凶了。',0,0)
            G.call("talk",'',174,'   查明凶手真相一事，那便拜托白长老了。',2,1) 
            G.call("talk",'阿  朱',172,'    弟妹多多保重，在下千辞。',0,0)
            G.call('地图_进入地图','客栈',3,59)
            G.call("talk",'',134,'   大哥，这【带头大哥】竟然是大理段王爷，这可如何是好？',2,1) 
            G.call("talk",'',36,'   我知道你担心什么，我只是去问个清楚，然后我们便到塞外打猎放羊去也！',0,0)
            G.call("talk",'',134,'   大哥去哪里，我就跟你去哪里！',2,1) 
            o_book_story.流程 = 6
        end
    elseif  o_book_story.流程 == 5 then
        G.call('地图_进入地图','少林寺',135,59)
        G.call("talk",'',36,'   萧峰拜会玄慈大师！',0,0)
        G.call("talk",'',175,'   既然萧施主都知道了，是不是想为父报仇，那就来吧！',2,1) 
        G.call("talk",'',36,'   不尽然，我只是想知道当年事情的始末！',0,0)
        G.call("talk",'',175,'   当年我也是错信他人，想我以为这种事情此人万万不会空传，才导致祸事发生！',2,1) 
        G.call("talk",'',36,'   到底是谁？',0,0)
        G.call("talk",'',175,'   这人已经过世，尘归尘，土归土，这些恩怨就让他在老衲手中了解吧！',2,1) 
        G.call("talk",'',36,'   弟子愚昧，叨扰了，阿朱，我们走！',0,0)
        G.call("talk",'',175,'   阿弥陀佛，善哉善哉！',2,1)
        G.call('地图_进入地图','塞外',69,59)
        G.call("talk",'',36,'   阿朱，以后我们就在这里打猎放羊，你可后悔？',0,0)
        G.call('join',134)
        G.call("talk",'',134,'   大哥去哪里，阿朱就陪大哥到哪里！大哥，上次我偷了部经书出来，本想送给公子，现今就转送给你了。',2,1)
        if G.call('get_item',94) == 0 then 
            G.call('add_item',94,1)
        end
        o_book_story.完成 = 1
        o_book_story.完美 = 1
        G.call('notice1','完成【天龙八部】梦幻剧情！')
    elseif  o_book_story.流程 == 6 then
        G.call('地图_进入地图','野外',258,59)
        G.call("talk",'',138,'   你莫非就是那大恶人，兄弟们一起上！',2,1)
        G.call("talk",'',36,'   阿朱，以后我们就在这里打猎放羊，你可后悔？',0,0)
        G.call('all_over')
        G.call('set_team',36,0,0,0)
        G.call('call_battle',1,258,4,150,54,138,137,55,0,0,0,66) 
        o_battle_结果 = G.call('get_battle') 
        if o_battle_结果   then
            G.call("talk",'',138,'   兄弟，你快退开，不用管我，去小镜湖禀报主公要紧。',2,1)
            G.call("talk",'',36,'   不理他，我们先去小镜湖吧！',0,0)
            G.call('地图_进入地图','小镜湖',262,59)
            G.call("talk",'',36,'   段王爷，萧某特来叨扰！',0,0)
            G.call("talk",'',60,'   乔帮主不知有何事？',2,1)
            G.call("talk",'',36,'   段王爷，我问你一句话，请你从实回答。当年你做过一件于心有愧的大错事，是也不是？虽然此事未必出于你本心，可是你却害得一个孩子一生孤苦，连自己爹娘是谁也不知道，是也不是？',0,0)
            G.call("talk",'',60,'   不错，段某生平为此事耿耿于心，每当念及，甚是不安。只是大错已经铸成，再也难以挽回。天可怜见，今日让我重得见到一个当没了爹娘的孩子，只是……只是……唉，我总是对不起人。',2,1)
            G.call("talk",'',36,'   你既知铸下大错，害苦了人，却何以直到此时，兀自接二连三的又不断再干恶事？',0,0)
            G.call("talk",'',60,'   段某行止不端，德行有亏，平生荒唐之事，实在干得太多，思之不胜汗颜。',2,1)
            G.call("talk",'',36,'   今晚三更，我在那座青石桥上相候，有事和阁下一谈。',0,0)
            G.call("talk",'',60,'   准时必到。',2,1)
            G.call("talk",'',36,'   这就好了。阿朱，咱们走吧。',0,0)
            G.call('地图_进入地图','客栈',3,59)
            G.call("talk",'',36,'   阿朱，我寻到了大仇人，你该当为我高兴才是。',0,0)
            G.call("talk",'',134,'   只是昨晚我....不说了，是啊，我原该高兴。',2,1)
            G.call("talk",'',36,'   今晚杀了此人之后，咱们即行北上，到雁门关外驰马打猎、牧牛放羊，再也不踏进关内一步了。唉，阿朱，我在见到段正淳之前，本曾立誓要杀得他一家鸡犬不留。但见此人倒有义气，心想一人作事一人当，那也不用找他家人了。',0,0)
            G.call("talk",'',134,'   你这一念之仁，多积阴德，必有后福。',2,1)
            G.call("talk",'',36,'   阿朱，你为什么不高兴？你不喜欢我再杀人么？',0,0)
            G.call("talk",'',134,'   不是不高兴，不知怎样，我肚痛得紧!',2,1)
            G.call("talk",'',36,'  路上辛苦，只怕受了风寒。你在这儿歇歇，睡了一觉醒来，我已取了段正淳的首级来啦。',0,0)
            G.call("talk",'',134,'   我好为难，大哥，我真是没有法子。我不能陪你了。我很想陪着你，和你在一起，真不想跟你分开……你……你一个人这么寂寞孤单，我对你不起。',2,1)
            G.call("talk",'',36,'   咱们只分开这一会儿，又有什么要紧？阿朱，你待我真好，你的恩情我不知怎样报答才是。',0,0)
            G.call("talk",'',134,'   不是分开一会儿，我觉得会很久很久。大哥，我离开了你，你会孤零零的，我也是孤零零的。最好你立刻带我到雁门关外，咱们便这么牧牛放羊去。段正淳的怨仇，再过一年来报不成么？让我先陪你一年。',2,1)
            G.call("talk",'',36,'   好容易撞见了他，今晚报了此仇，咱们再也不加中原了。段正淳的武功远不及我，他也不会使‘六脉神剑’，但若过得一年再来，那便要上大理去。大理段家好手甚多，遇上了精通‘六脉神剑’的高手，你大哥就多半要输。不是我不听你的话，这中间实有许多难处',0,0)
            G.call("talk",'',134,'   不错，我不该请你过一年再去大理找他报仇。你孤身深入虎穴，万万不可。',2,1)
            G.call("talk",'',36,'   若是我萧峰一人，大理段家这龙潭虎穴那也闯了，生死危难，浑不放在心上。但现下有了小阿朱，我要照料陪伴你一辈子，萧峰的性命，那就贵重得很啦。',0,0)
            G.call('地图_进入地图','小镜湖',262,59)
            G.call("talk",'阿  朱',60,'   乔帮主见如，不知有何见教？',2,1)
            G.call("talk",'',36,'   段王爷，我约你来此的用意，难道你竟然不知么？',0,0)
            G.call("talk",'阿  朱',60,'   你是为了当年雁门关外之事，我误听奸人之言，受人播弄，伤了令堂的性命，累得令尊自尽身亡，实是大错。',2,1)
            G.call("talk",'',36,'   为人子弟，父母师长的大仇不能不报。你杀我父亲、、义父、义母、受业恩师，一共五人，我便击你五掌。你受我五掌之后，是死是活，前仇一笔勾销。',0,0)
            G.call('all_over')
            G.call('set_team',36,0,0,0)
            G.call('call_battle',1,258,4,0.0001,134,0,0,0,0,0,0,66) 
            G.call("talk",'',36,'   怎地他不举掌相迎？又如此不济？怎地他变得这么轻了？阿朱，阿朱，原来是你！',0,0)
            G.call("talk",'',134,'   大哥，我……我……好生对你不起，你恼我吗？',2,1)
            G.call("talk",'',36,'   我不恼你，我恼我自己，恨我自己。',0,0)
            G.call("talk",'',134,'   大哥，你答允我，永远永远，不可损伤自己。',2,1)
            G.call("talk",'',36,'   你为什么？为什么？为什么？！',0,0)
            G.call("talk",'',134,'   你看我左肩这个段字九明白了，我也是昨晚才知道！',2,1)
            G.call("talk",'',36,'   我明白啦，我马上得设法给你治伤，这些事，慢慢再说不迟。”',0,0)
            G.call("talk",'',134,'   害死你爹爹妈妈的人，竟是我爹爹，唉，老天爷的安排真待咱们太苦，而且，而且……从马夫人口中，套问出我爹爹名字来的，便是我自己。',2,1)
            G.call("talk",'',36,'   你为什么不跟我说了？要是我知道他便是你的爹爹……',0,0)
            G.call("talk",'',134,'   我翻来覆去，思量了很久很久，大哥，我多么想能陪你一辈子，可是那怎么能够？我能求你不报这五位亲人的大仇么？就算我胡里胡涂的求了你，你又答允了，那……那终究是不成的。',2,1)
            G.call("talk",'',36,'   你可以叫你爹爹逃走，不来赴这约会！或者你爹爹是英雄好汉，不肯失约，那你可以乔装了我的模样，和你爹爹另订约会，在一个遥远的地方，在一个遥远的日子里再行相会。你何必，何必这样自苦？',0,0)
            G.call("talk",'',134,'   我要叫你知道，一个人失手害死了别人，可以全非出于本心。你当然不想害我，可是你打了我一掌。我爹爹害死你的父母，也是无意中铸成的大错。',2,1)
            G.call("talk",'',36,'   阿朱，阿朱，你一定另有原因，不是为了救你父亲，也不是要我知道那是无心铸成的大错，你是为了我！你是为了我！你完全是为了我，阿朱，你说是不是？',0,0)
            G.call("talk",'',134,'   大理段家有六脉神剑，你打死了他们镇南王，他们岂肯干休？大哥，那易筋经上的字，咱们又不识得……',2,1)
            G.call("talk",'',36,'   原来你都是为了我，可我还...........',0,0)
            G.call("talk",'',134,'   大哥，我真想和你一起去塞外打猎放羊，那样该多好.........',2,1)
            G.call("talk",'',36,'   阿朱，你就这样走了，为什么，为什么，为什么..........',0,0)
            o_book_story.完成 = 1
            G.call('notice1','完成【天龙八部】梦幻剧情！')

        else
            G.call("talk",'',138,'   这点本事就想做恶人吗？',2,1)
        end
 
    end
    G.call('all_over')
    G.call('add_time',2)
    G.call('dark')
    G.call('goto_map',4)
end
t['天书_射雕英雄传'] = function()
    local o_book_story = G.QueryName(0x101c0005)
    if not G.call('in_team',37) then 
        G.call("talk",'',38,'   本故事没有郭靖是无法进行的！',2,1)
        G.call('all_over')
        return
    end 
    if o_book_story.流程 == 0 then
        
    end
end